__author__ = "Варвара Синюгина ИВТ-20"
""" 
Задача №1 (1)
https://ivtipm.github.io/Programming/Glava01/index01.htm#z1
"""

a = float(input("Введите действительное а: "))
b = float(input("Введите действительное b: "))

res = a + b
print(f"Сложение: {res:.5f}")

res = a - b
print(f"Разность: {res:.5f}")

res = a * b
print(f"Произведение: {res:.5f}")